In [1]:
%matplotlib inline
import pandas as pd

In [2]:
titles = pd.read_csv('https://raw.githubusercontent.com/DataScience75/Batch-114/refs/heads/main/titles.csv')
titles.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993
3                  Country  2000
4               Gaiking II  2011

In [3]:
cast = pd.read_csv('D:/TopMentor_DS_course/Advance_python_Pandas_S2/cast/cast.csv')
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### What are the ten most common movie names of all time?

In [4]:
cast['title'].value_counts().head(10)

title
Around the World in Eighty Days       383
7 cajas                               191
The Dark Knight Rises                 173
The Ten Commandments                  167
The Buccaneer                         158
King Kong                             158
Cockneys vs Zombies                   157
Stuck on You                          153
The Eschatrilogy: Book of the Dead    144
Thelma                                139
Name: count, dtype: int64

### Which three years of the 1930s saw the most films released?

In [31]:
cast[(cast['year']//10*10)==1930].groupby('year')['title'].nunique().sort_values(ascending=False).head(3)

year
1936    1012
1937    1009
1938     945
Name: title, dtype: int64

### Plot the number of films that have been released each decade over the history of cinema.

In [7]:
cast['decade'] = (cast['year']//10*10)

In [35]:
cast.groupby('decade')['title'].nunique().reset_index(name='no_of_films')

    decade  no_of_films
0     1890            1
1     1900            8
2     1910         4760
3     1920         6890
4     1930         8589
5     1940         7168
6     1950         9160
7     1960        10676
8     1970        11749
9     1980        12772
10    1990        15352
11    2000        29232
12    2010        44925
13    2020           24

### Plot the number of "Hamlet" films made each decade.

In [37]:
cast[cast['title']=='Hamlet'].groupby('decade')['title'].size().reset_index(name='no_of_Hamlet_films')

   decade  no_of_Hamlet_films
0    1910                   9
1    1920                   3
2    1940                   4
3    1960                  34
4    1970                   5
5    1990                  35
6    2000                  19
7    2010                   4

### Plot the number of "Rustler" characters in each decade of the history of film.

In [38]:
cast[cast['character']=='Rustler'].groupby('decade')['character'].size().reset_index(name='no_of_Rustler_character')

   decade  no_of_Rustler_character
0    1920                        4
1    1930                       35
2    1940                        9
3    1950                        6
4    1960                        2
5    1970                        6
6    1990                        3

### Plot the number of "Hamlet" characters each decade.

In [39]:
cast[cast['character']=='Hamlet'].groupby('decade')['character'].size().reset_index(name='no_of_Hamlet_character')

   decade  no_of_Hamlet_character
0    1910                       2
1    1930                       3
2    1950                       2
3    1960                       4
4    1970                       2
5    1980                       1
6    1990                       7
7    2000                       8
8    2010                       9

### What are the 11 most common character names in movie history?

In [12]:
cast['character'].value_counts().head(11)

character
Himself        8438
Policeman      3043
Doctor         2799
Extra          2765
Reporter       2692
Townsman       2634
Bartender      2414
Waiter         2296
Henchman       2140
Dancer         2002
Party Guest    1905
Name: count, dtype: int64

In [45]:
# cast.groupby('character').size().sort_values(ascending=False)

### Who are the 10 people most often credited as "Herself" in film history?

In [50]:
cast[cast['character']=='Herself'].groupby('name').size().sort_values(ascending=False).head(10)

name
Aleli Estrada       1
Ali Harter          1
Voin de Voin        1
Velvet Crayon       1
Taylor Christina    1
Sui the Dog         1
Sharon A. Fox       1
Ren? Biaggi         1
Rebecca Hudson      1
Nelly Diener        1
dtype: int64

### Who are the 10 people most often credited as "Himself" in film history?

In [55]:
cast[cast['character']=='Himself'].groupby('name').size().sort_values(ascending=False).head(10)

name
Adolf Hitler         99
George W. Bush       23
Winston Churchill    23
Bill Clinton         20
Muhammad Ali         17
Billy Graham         15
Amitabh Bachchan     13
Jimmy Carter         13
Walter Cronkite      11
Fidel Castro         11
dtype: int64

### Which actors or actresses appeared in the most movies in the year 1945?

In [61]:
cast[cast['year']==1945]['name'].value_counts().head(5)

name
Sam (II) Harris        32
Franklyn Farnum        26
Herman Hack            24
Edmund Cobb            24
Horace B. Carpenter    23
Name: count, dtype: int64

### Which actors or actresses appeared in the most movies in the year 1985?

In [62]:
cast[cast['year']==1985]['name'].value_counts().head(5)

name
Raj Babbar         15
Asrani             13
Danny Denzongpa    11
Iftekhar           10
Prem Chopra         9
Name: count, dtype: int64

### Plot how many roles Mammootty has played in each year of his career.

In [67]:
cast[cast['character']=='Mammootty']['year'].value_counts()

year
1991    1
1982    1
1992    1
Name: count, dtype: int64

### What are the 10 most frequent roles that start with the phrase "Patron in"?

In [72]:
cast[cast['character'].str.startswith('Patron in',na=False)]['character'].value_counts().head(10)

character
Patron in Frisky Rabbit         5
Patron in the Coffee House      3
Patron in Coffee Shop           2
Patron in Club                  2
Patron in restaurant            2
Patron in Chinese Restaurant    1
Patron in Diner                 1
Patron in Cafe                  1
Patron in booth                 1
Patron in video store           1
Name: count, dtype: int64

### What are the 10 most frequent roles that start with the word "Science"?

In [73]:
cast[cast['character'].str.startswith('Science',na=False)]['character'].value_counts().head(10)

character
Science Teacher              17
Science Student               7
Science Club Member           4
Science Fair Kid              2
Science Kid                   2
Science Reporter              2
Science Performer 3           1
Science Fair Student          1
Science                       1
Science Fair Crowd Member     1
Name: count, dtype: int64

### Plot the n-values of the roles that Judi Dench has played over her career.

In [78]:
cast[cast['name']=='Cary Grant']

Empty DataFrame
Columns: [title, year, name, type, character, n, decade]
Index: []

### Plot the n-values of Cary Grant's roles through his career.

In [79]:
cast[cast['name']=='Cary Grant']['n']

840334    10.0
840335     1.0
840336     1.0
840337     1.0
840338     3.0
          ...
840411     1.0
840412     2.0
840413     2.0
840414     2.0
840415     NaN
Name: n, Length: 82, dtype: float64

### Plot the n-value of the roles that Sidney Poitier has acted over the years.

In [82]:
cast[cast['name']=='Sidney Poitier']['n']

Series([], Name: n, dtype: float64)

### How many leading (n=1) roles were available to actors, and how many to actresses, in the 1950s?

In [86]:
cast[(cast['n']==1) & (cast['decade']==1950)]['type'].value_counts()

type
actor    2926
Name: count, dtype: int64

### How many supporting (n=2) roles were available to actors, and how many to actresses, in the 1950s?

In [88]:
cast[(cast['n']==2) & (cast['decade']==1950)]['type'].value_counts()

type
actor    2080
Name: count, dtype: int64